---
layout: post
title:  Notes for "Cypher"
date:   2019-02-22 16:00:06 +0800
background: '/img/note/cyper.png'
categories: jekyll update
--- 
#### Query node by label and attribution
```python
    # return note which label is '中药'; id is 'md4233'
    MATCH (n:`中药`) where n.id='md4233' RETURN n 
```

#### Query node by relationship
- Return relationshio type
```python
    MATCH (n:中药)-[r]->(m) RETURN r,type(r); 
    """ return r's type 
    ╒════════════╤═════════╕
    │"r"         │"type(r)"│
    ╞════════════╪═════════╡
    │{"weight":1}│"子概念"  │
    ├────────────┼─────────┤
    │{"weight":1}│"子概念"  │
    ├────────────┼─────────┤
    """
```

- Query node by relationship type
```python
    # return notes which are the start nodes of relationship '子概念'
    MATCH (n)-[r:子概念]->(m) RETURN n; 
```
